# მომხმარებელს შეეკითხეთ სწავლობს თუარა გოაში, თუ სწავლობს შეეკითხეთ ომელ ჯგუფშია, თუ პასუხი იქნება ჯგუფი13 შეეკითეთ რომ არის თუ არა გაბრიელი მისი მენტორი, თუ პასუხი იქნება კი უთხარით რომ თქვენც აქ სწავლობთ და ნამდვილად გაბრიელია ორივეს მენტორი, თუ პასუხი არიქნება გაბრიელი ყველა სხვა შემთხვევაში დაუბეჭდეთ რომ ის ტყუის და არარის სინამდვილეში ჯგუფ13-ში 😉


question = input("სწავლობ გოაში(კი ან არა)?:  ")
answer = "კი"
answer1 = "არა"
answer02 = "13"


if question == answer:
   question1 = input("რომელ ჯგუფში ხარ?:  ")
   if question1 == answer02:
        question02 = input("ბატონი გაბრიელი გასწავლის?:  ")
        if question02 == answer:
            print("სწორია! მეც მასწავლის ბატონი გაბრიელი <3")
        else:
            print("ნუ ტყუი!")
            question3 = input(" რომელ ჯგუფში ხარ?")
            print("ესე არ ჯობია?გოაში არ იტყუებიან!<3")

elif question == answer1:
    print("მაშინ შემოუერთდი გოას")
else:
     print("კარგია")
#by ანდრია ქორჩილავა <3