#1)რომელ ბიბლიოთეკას ვიყენებთ პითონში გეომეტრიული ფიგურების ასაგებად?
#სწორი პასუხი იყო turte-ი. მისი მეშვეობით შეგვეძლია დავხაზოთ ფიგურები

#2)რომელ ფუნქციას ვიყენებთ, როდესაც გვინდა, რომ ტერმინალში მოვახდინოთ დაბეჭვდა?
#სწორი პასუხი იყო print-ი.მისი მეშვეობით ჩვენ შეგვიძლია გამოვიტანოთ თითქმის ყველაფერი პითონში. 

#3)პითონის გამოყენებით შეუშლებელია ალგორითმების შექმნა
#ეს იყო false.

#4)ათწილადებზე სამუშაოდ რომელ მონაცემთა ტიპს ვიყენებთ?
#სწორი პასუხი იყო float-ი. ჩვენ ვიცით რომ პითონში float-ი ათწილადს ნიშნავს.

#5)რომელია პითონისთვის სწორი კომენტარი?
#სწორი პასუხი იყო #.ეხლაც მე კომენტარის სახიტ ვწერ კითხვებს და პასუხებს

#6)რომელ ფუნქციას ვიყენებთ მომხმარებლისგან ტერმინალიდან ტექსტის მისაღებად?
#სწორი პასუხი იყო input-ი.მისი საშოალებით მომხმარებელს შეუძლია შეიყვანოს თავისთვის საჭირო ინფორმაცია. 

#7)ინპუთიდან მიღებული ინფორმაცია ინახება სტრინგის სახით. 
#სწორი პასუხი იყო true.

#8)როგორ ვამოწმებთ მონაცემთა ტიპს?
#სწორი პასუხი იყო type(x). type-ის მეშვეობით ჩვენ შეგვიძლია შევამოწმოთ სხვდასხვა ინფორმაციის ტიპი. 

#9)რომელი ცვლადი ინახავს ათწილადს?
#სწორი პასუხი იყო x = 10/2. როცა ჩვენ პითონს ამ განტოლებას ამოვახსნევინებთ გამოგვიტანს 5,0ს.თუ გვინდა რომ არ იყოს ათწულადი უნდა დავუმატოთ ერთი დახრილი ხაზი.10//2

#10)რომელ ვარიანტშია პითონის ცვლადი სწორად შექმნილი?
#სწორი პასუხი იყო x = 12.

#11)რას გამოიტანს კოდი?
#name = "goal"
#surname = "orientadze"
#age = 100
#print(name + surname + age)
#სწორი პასუხი იყო error. სტრინგი და ინტეჯერი ერთმანეთს არ ემატება. 

#12)რას გამოიტანს კოდი?
#num1 = 10
#num2 = 20
#print(str(num1) + str(num2))
#სწორი პასუხი იყო 1020. ისინი სტრინგებად რომ არ გადაგვექცია ჩვეულებრივად შეიკრიბებოდნენ. 

#13)რას გამოიტანს კოდი როდესაც მომხმარებელი შეიტანს 7-ს. 
#სწორი პასუხი იყო <class 'float'>. ახედეთ კითხვა ნომერ 4)-ს რომ გაიგოთ რატომ არის ეს პასუხი სწორი. 

#14)პასუხია:
#x = ((true and false) or (false or false))
#y = ((false or true) and (false and true))
#print((x and y) or true)
#საკმარისია  შეამჩნიო პრინტში or true. აზრი არ აქვს დანარჩენძე დაკვირვებას. ავტომატურად პასუხი იქნება true.

#15)რას გამოიტანს კოდი როდესაც მომხმარებელი შეიტანს 20-ს:
# age = int(input("enter your age:  "))
# print(age > 18)
# პასუხია true. თუ მომხმარებელი შეიყვანს 20-ს მაშინ რათქმაუნდა 20 მეტი იქნება 18-ზე და გამოიტანს true-ს. 
