printhello
#print("hello").
#ეს არის ერთერთი უმარტივესი კოდი. ჩვენ პრინტ ბრძანებით შეგვიძლია გამოვიტანოთ ეკრანზე ნებისმიერი სიტყვა.

1day -> 16
#day = 16.
#ეს არის ინტეჯერ ტიპის ცვლადი. ამის საშოალებით შეგვიძლია შევინახოთ რიცხვითი ინფორმაცია.

1month ==() february
#month = "february".
# ეს არის სტრინგ ტიპის ცვლადი. ამის საშოალებით შეგვიძლია შევინახოთ სიტყვიერი ინფორმაცია.

print goa_teacher
goa_teacher = "nika keshelava"
#goa_teacher = "nika keshelava"
#print(goa_teacher)
#ამ შემთხვევაში ჩვენ გვაქვს სტრინგ ტიპის ცვლადი და გვინდა მისი მნიშვნელობა პრინტ ბრძანებით გამოვიტანოთ ეკრანზე.

.:goa acade mbest
#goa_academy = "best"
#ჩვენ არ შეგვიძლია ცვლადის სახელში გამოვიყენოთ space.

(forward"" 100)
#from turtle import *
#forward(100)
#turtle-ს მეშვეობით ჩვენ შეგვიძლია შევქმნათ ფიგურები.

age) = "500"
age = age + 10000000000
#age = 500
#age = age + 10000000000
#ჩვენ გვაქვს ინტეჯერ ტიპის ცვლადი რომელსაც გვინდა დავუმატოთ ჩვენს მიერ მოცემული რიცხვი.

age) = 13
print(("მე ვარ") ხ+ (age))
#age = 13
#print(("მე ვარ") + str(age))
#ჩვენ არ შეგვიძლია სტრინგი ინტეჯერს დავუმატოთ და ამიტომაც ინტეჯერს წინ ვუწერთ str=სტრინგის აღმნიშვნელ შემოკლებით სახელს

from_turtle_import_*)
#from turtle import *
#წესი space-თან დაკავშირებით მხოლოდ ცვლადის სახელებზე და პრინტისნაირებზე ვრცელდება

1st_place = "goa"
#first_place = "goa"
#ცვლადის სახელის წინ რიცხვი არ იწერება

print 500 + 300)
#print (500 + 300)
#ამ შემთხვევაში ჩვენ გვინდა რომ ორი რიცხვი ერთმანეთს დავუმატოთ. შეცდომა ის იყო რომ ჩვენ დაგვავიწყდა ბრჩხილები

print"Great Progress)
#print("Great Progress")
#ამ შემთხვევაში ჩვენ გვინდა რომ დავპრინტოთ სიტყვა. შეცდომა იმაში მდგომარეობს რომ ბრჩხილები და ბრჭყალები არ იყო ბოლომდე დაწერილი