#5) შექმენით დროში მოგზაურობის ფუნქცია რომელიც მომხმარებელს შეეკითხება მის ახლანდელ ასაკს და ამჟამინდელ წელს, ასევე რამდენი ხანით სურს დროშ მოგზაურობა შემდეგ კი ფუნქციამ უნდა დააბრუნოს დაბეჭდოს დროში მოგზაურობის შემდეგ რომელი წელი იქნება და რამდენი წლის იქნება მომხმარებელი, ასევე დაამატეთ რომ მომხმარებელმა მიიღოს გადაწყვეტილება წარსულში სურს დრში მოგზაურობა თუ მომავალში
def future():
    age = int(input("რამდენი წლის ხარ?:  "))
    question = int(input("წარსული=1, თუ მომავალი=2?:  "))
    if question == 1:
        question1 = int(input("რამდენი ხნით?"))
        year = 2024 - question1
        age = age - question1
        print(str(question1) + " წლის წინ შენ იყავი " + str(age) + "წლის და იყო" + str(year) + " წელი")
    elif question == 2:
        question1 = int(input("რამდენი ხნით?"))
        year = 2024 + question1
        age = age + question1
        print(str(question1) + " წლის შემდეგ შენ იქნები " + str(age) + "წლის და იქნება" + str(year) + " წელი")