#შექმენით სია, შეიტანეთ 5 მნიშვნელობა, შემდეგ 3 მნიშვნელობა შეცვალეთ და გამოიტანეთ სია.
my_list = ["ვაშლი", "ბანანი", "ატამი", "მანგო", "კივი"]

my_list[1] = "მსხალი" 
my_list[3] = "ანანასი" 
my_list[4] = "ყურძენი" 

print("განახლებული სია:", my_list)

#2) შექმენით რიცხვების სია და ერთამენთს დაუმატეთ და გამოიტანეთ საბოლოო ჯამი.
numbers = [10, 20, 30, 40, 50]

total = sum(numbers)

print("რიცხვების ჯამი:", total)

#3) შექმენით სტრინგების სია, გადაეცით 6 სიტყვა და შემდგომ ეს სიტყვები დაუმატეთ ერთმანეთს და გამოიტანეთ ფრაზა.
words = ["ეს", "არის", "საოცარი", "Python", "კოდი", "!"]

phrase = " ".join(words)

print(phrase)
