#მოსწავლეს შემოატანინეთ სკოლის ტესტში მიღებული ნიშანი, თუ ეს მიღებული ნიშანი უდრის 10 - ს, მაგ შემთხვევაში მასწავლებელმა, მშობელთან შეაქოს მოსწავლე, თუ მიღებული ნიშანი უდრის 8 -ს ან 9 - ს, მაგ შემთხვევაში, მასწავლებელმა, მშობელს პატარა შენიშვნა მისცეს. თუ მიღებული ქულა უდრის 5  - ს მაგ შემთხვევაში, მასწავლებელმა, მშობელს მისცეს შენიშვნა, ხოლო თუ მიღებული ნიშანი ნაკლებია 5 ზე, მაგ შემთხვევაში, მასწავლებელმა გააგდოს მოსწავლე სკოლიდან
score = int(input("რა ქულა მიიღე ტესტში?:  "))

if score == 10:
    print("თქვენი შვილი ძალიან კარგად სწავლობს")

elif 8 == score == 9:
    print("შეეძლო უკეთესად ესწავლა")

elif score == 5: 
    print("გთხოვთ თქვენს შვილს მიაქციეთ ყურადღება")

elif 5 > score:
    print("თქვენი შვილი არ სწავლობს. ის გაგდებულია სკოლიდან")

